const text = "Цены: 100$, 500$, и 1000$";
const priceRegex = /\d+\$/g;
const result = text.match(priceRegex);
document.writeln(result);

// const hasDigits = /\d+/; // ищем 1 или более цифр

// document.writeln(hasDigits.test("Привет мне, 29 лет"));
// document.writeln(hasDigits.test('Привет как ты?'));


/*
\d - любая цифра от 0 до 9
\w - любая буква (латиница) или знак _
\s - любой пробелный символ(пробел, табуляция, перенос строки)
. - любой символ (кроме переноса строки)

Квантификаторы 
+ - один или более раз
* - 0 или более раз
? - ноль или один раз
{n} - ровно n раз -\d{4} - 

Флаги
i - искать без учета регистра (А, и а)
g - глобальный поиск (найти все совпадения, а не только первое)
*/ 